facts = [
    {
        "title": "🔥 Реальный костюм, настоящие полёты",
        "text": "Том Холланд выполнял часть трюков сам — особенно прыжки на тросах. Режиссёры хотели сделать Паука максимально живым.",
        "img": "/static/facts/peter_stunt.jpg",
        "alt": "🔥 Реальный костюм, настоящие полёты"
    },
    {
        "title": "🕸 Более 150 вариантов костюма",
        "text": "Художники создали десятки вариантов: от классических до футуристичных. Некоторые использовались только в тестах.",
        "img": "/static/facts/suit_variants.webp",
        "alt": "🕸 Более 150 вариантов костюма"
    },
    {
        "title": "🧪 Иллюзии Мистерио снимались как реальные миниатюры",
        "text": "Для некоторых сцен создавались настоящие модели и зеркальные конструкции, а CGI накладывался поверх.",
        "img": "/static/facts/mysterio_behind.png",
        "alt": "🧪 Иллюзии Мистерио снимались как реальные миниатюры"
    },
    {
        "title": "📱 Холланд узнал о роли через Instagram",
        "text": "Marvel выложили пост, где было объявлено, что Том — новый Человек-паук. Он подумал, что его разыгрывают.",
        "img": "/static/facts/instagram_cast.jpg",
        "alt": "📱 Холланд узнал о роли через Instagram"

    },
    {
        "title": "😵 Маска Паука полностью переделывается на компьютере",
        "text": "Любые эмоции глаз — CGI. Реальная маска не умеет менять форму.",
        "img": "/static/facts/cg_mask.jpg",
        "alt": "😵 Маска Паука полностью переделывается на компьютере"
    },
    {
        "title": "🌀 Венеция в фильме была частично затоплена по-настоящему",
        "text": "Во время съёмок город столкнулся с наводнением, и это помогло создать реалистичные сцены.",
        "img": "/static/facts/venice_real.jpg",
        "alt": "🌀 Венеция в фильме была частично затоплена по-настоящему"
    },
    {
        "title": "🎨 Чёрно-красный костюм предложил сам Том Холланд",
        "text": "Он хотел, чтобы Питер выглядел взрослее и серьёзнее.",
        "img": "/static/facts/red_black_suit.jpg",
        "alt": "🎨 Чёрно-красный костюм предложил сам Том Холланд"
    },
    {
        "title": "💔 Сцену смерти Мэй снимали в двух версиях",
        "text": "Одна была мягче, другая — жестче. В итоге выбрали ту, что бьёт сильнее всего.",
        "img": "/static/facts/may_scene.avif",
        "alt": "💔 Сцену смерти Мэй снимали в двух версиях"
    },
    {
        "title": "🔧 Щупальца Дока Ока реагируют на голос актёра",
        "text": "Звукодизайнеры сделали так, чтобы движения щупалец изменялись от интонации.",
        "img": "/static/facts/doc_ock_arms.jpg",
        "alt": "🔧 Щупальца Дока Ока реагируют на голос актёра"
    },
    {
        "title": "⚡ Цвет молний Электро изменили ради комиксов",
        "text": "В MCU они жёлтые — как у оригинальной версии Электро из комиксов 616.",
        "img": "/static/facts/electro_new.jpg",
        "alt": "⚡ Цвет молний Электро изменили ради комиксов"
    },
    {
        "title": "🕳 Нед мог стать Хобгоблином",
        "text": "Marvel оставили несколько намёков на будущую трансформацию, но пока не использовали их.",
        "img": "/static/facts/ned_magic.webp",
        "alt": "🕳 Нед мог стать Хобгоблином"
    },
    {
        "title": "🌌 Сцену с тремя Пауками снимали на полностью пустой площадке",
        "text": "Не было ни декораций, ни фона — только хромакей и пластиковая голова Гоблина.",
        "img": "/static/facts/three_spiders_bts.jpg",
        "alt": "🌌 Сцену с тремя Пауками снимали на полностью пустой площадке"
    },
    {
        "title": "💬 «Я люблю вас, ребята» — чистая импровизация",
        "text": "Эндрю Гарфилд придумал фразу на месте, и она стала одной из самых трогательных в фильме.",
        "img": "/static/facts/andrew_improv.jpg",
        "alt": "💬 «Я люблю вас, ребята» — чистая импровизация"
    },
]
