glossary = [
    {
        "title": "E.D.I.T.H.",
        "text": "Очки Тони Старка с искусственным интеллектом. Управляют спутниками, дронами и системами наблюдения."
    },
    {
        "title": "Мультивселенная",
        "text": "Система параллельных миров, где существуют разные вариации Питера Паркера и других героев."
    },
    {
        "title": "Damage Control",
        "text": "Государственная служба, изучающая разрушенные технологии Мстителей и инопланетные артефакты."
    },
    {
        "title": "Иллюзии Мистерио",
        "text": "Комплекс дронов и проекторов, создающих фальшивые монстров, разломы и разрушения."
    },
    {
        "title": "Паучье чутьё (Spider-Sense)",
        "text": "Интуитивное чувство опасности, позволяющее Питеру реагировать быстрее обычного человека."
    },
    {
        "title": "Бросатели паутины",
        "text": "Устройства, выпрыскивающие синтетическую паутину. Питер разработал их сам."
    },
    {
        "title": "Iron Spider Suit",
        "text": "Продвинутый костюм от Старка с механическими лапами и усиленной защитой."
    },
    {
        "title": "Порталы Стрэнджа",
        "text": "Магические порталы, открываемые кольцом Sling Ring для мгновенного перемещения."
    },
    {
        "title": "Заклинание Забвения",
        "text": "Магия, стирающая воспоминания людей о личности Питера Паркера."
    },
    {
        "title": "Арка реактора",
        "text": "Миниатюрный источник энергии, созданный Тони Старком. Используется в его технологиях."
    },
    {
        "title": "Симбиот",
        "text": "Инопланетная форма жизни, усиливающая носителя, но влияющая на его характер."
    },
    {
        "title": "Нексус-событие",
        "text": "Момент, создающий альтернативную ветку времени и новую реальность."
    },
    {
        "title": "Элементали",
        "text": "Иллюзорные существа, созданные Мистерио с помощью дронов и голографических проекций."
    },
    {
        "title": "Stark Industries",
        "text": "Технологическая корпорация Тони Старка, разрабатывающая передовые вооружения и ИИ."
    },
    {
        "title": "Мстители",
        "text": "Команда супергероев Marvel, защищающая Землю от глобальных угроз."
    },
    {
        "title": "Противостояние",
        "text": "События фильма «Первый мститель: Противостояние» (2016), приведшие к расколу Мстителей."
    }
]
