# glossary.py

glossary = [
    {
        "title": "E.D.I.T.H.",
        "text": "Очки Тони Старка с искусственным интеллектом. Управляют спутниками, дронами и системами наблюдения."
    },
    {
        "title": "Мультивселенная",
        "text": "Система параллельных миров, где существуют разные вариации Питера Паркера и других героев."
    },
    {
        "title": "Damage Control",
        "text": "Государственная служба, изучающая разрушенные технологии Мстителей и инопланетные артефакты."
    },
    {
        "title": "Иллюзии Мистерио",
        "text": "Комплекс дронов и проекторов, создающих фальшивые монстров, разломы и разрушения."
    },
    {
        "title": "Паучье чутье (Spider-Sense)",
        "text": "Интуитивное чувство опасности, позволяющее Питеру реагировать быстрее обычного человека."
    },
    {
        "title": "Бросатели паутины",
        "text": "Устройства, выпрыскивающие синтетическую паутину. Питер разработал их сам."
    },
    {
        "title": "Iron Spider Suit",
        "text": "Продвинутый костюм от Старка с механическими лапами и усиленной защитой."
    },
    {
        "title": "Порталы Стрэнджа",
        "text": "Магические проходы, открываемые кольцом Sling Ring для мгновенного перемещения."
    },
    {
        "title": "Заклинание Забвения",
        "text": "Магия, стирающая воспоминания людей о личности Питера Паркера."
    },
    {
        "title": "Арка реактора",
        "text": "Миниатюрный источник энергии, созданный Тони Старком. Используется в его технологиях."
    },
    {
        "title": "Симбиот",
        "text": "Инопланетная форма жизни, усиливающая носителя, но влияющая на его характер."
    },
    {
        "title": "Нексус-событие",
        "text": "Момент, создающий альтернативную ветку времени и новую реальность."
    },
    {
        "title": "Щит Мстителей",
        "text": "Обозначение группы технологий и организаций, работающих с героями Земли."
    },
    {
        "title": "Чёрно-красный костюм",
        "text": "Новая версия костюма Питера, символизирующая его взросление."
    },
    {
        "title": "Технологии Старка",
        "text": "Система гаджетов, ИИ, дронов, костюмов и боевой техники Тони Старка."
    },
    {
        "title": "Паутина-парашют",
        "text": "Трюк, при котором Питер формирует большой купол из паутины для замедления падения."
    },
    {
        "title": "Паутина-бомба",
        "text": "Густой комок паутины, который моментально обездвиживает врага."
    },
]
